In [1]:
import pandas as pd
import matplotlib.pyplot as plt
from classes.classdatabasemanager import DatabaseManager
from utils.logger_utils import logging

# classe DatabaseManager para poder acedar as tabelas
db_manager = DatabaseManager()

# tabelas carregadas em df
df_produtos = db_manager.fetch_data_to_df("SELECT * FROM produtos;")
df_clientes = db_manager.fetch_data_to_df("SELECT * FROM clientes;")
df_atendentes = db_manager.fetch_data_to_df("SELECT * FROM atendentes;")
df_vendas = db_manager.fetch_data_to_df("SELECT * FROM vendas;")
df_lojas = db_manager.fetch_data_to_df("SELECT * FROM lojas;")

# mostrar os primeiros 5 registos
display(df_produtos.head())
display(df_clientes.head())
display(df_atendentes.head())
display(df_vendas.head())
display(df_lojas.head())

   ID_Produto Nome_Produto   Categoria   Preço
0           1         rest      Roupas  380.64
1           2         next  Brinquedos  822.26
2           3      discuss      Móveis  220.27
3           4    professor   Alimentos  453.94
4           5           no   Alimentos  887.23

,ID_Cliente,Nome,Idade,Email,Telefone
0,1,Ronald Hamilton,74,jennifer93@hotmail.com,514.274.1458
1,2,David Rios,28,andersonlisa@yahoo.com,555-038-0266
2,3,Gary Bennett,75,amanda62@horn.com,+1-666-391-8179x0940
3,4,Terry Duffy,20,stephanie21@hotmail.com,087.472.1372
4,5,Erica Williams,24,qjohnson@yahoo.com,352.473.5798x132

,ID_Atendente,Nome,Idade,Email,Telefone
0,1,Andrea Parks,30,fhammond@yahoo.com,(854)128-3938x430
1,2,Thomas Meyers,51,rnelson@ferguson.com,399-264-9243x5741
2,3,Nicole Wilson,53,pschwartz@hicks.net,+1-023-051-7629x76733
3,4,Megan Marshall,56,melanie20@meyers-hudson.biz,001-004-133-5648x482
4,5,Gary Stewart,32,jenniferlee@berry.com,+1-235-062-7602x5125

,ID_Venda,ID_Cliente,ID_Produto,ID_Loja,ID_Atendente,Quantidade,Data
0,1,44,28,47,33,5,2020-06-15
1,2,17,4,24,28,3,2024-01-25
2,3,30,46,6,11,10,2021-06-28
3,4,24,38,25,9,7,2020-12-24
4,5,41,30,20,41,1,2024-01-23

,ID_Loja,Nome_Loja,Endereço,Telefone
0,1,"Perez, Phillips and Fitzpatrick","20944 Maurice Summit\nMorenostad, VT 50348",+1-723-083-8020x23905
1,2,Johnson and Sons,"8382 Townsend Park\nWallacetown, UT 48618",810-356-4992x40290
2,3,Murphy Inc,"218 Crosby Summit\nJohnmouth, RI 26384",363-637-9160x148
3,4,Bennett Group,"34823 Patel Cliff\nNorth Andrew, NY 71985",181.111.2769x8119
4,5,Stephens-Henderson,"6640 Vaughan Creek\nPort Coryland, MI 21419",7167931950